app/controllers/api/v1/metrics_controller.rb

      def index
        metrics = Metric.all
---
SELECT "metrics".* FROM "metrics"

      def create
        metric = Metric.new(metric_params)

        if metric.save
---
INSERT INTO "metrics" ("name", "key", "timestamp", "value", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"