app/models/metric.rb

    def update_or_create(attributes)
      assign_or_new(attributes).save
---
INSERT INTO "metrics" ("name", "key", "value", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "GitHub PR delayed"], ["key", "pull_requests:delayed"], ["value", 3], ["created_at", "2022-08-19 13:16:44.254363"], ["updated_at", "2022-08-19 13:16:44.254363"]]
UPDATE "metrics" SET "timestamp" = $1, "updated_at" = $2 WHERE "metrics"."id" = $3  [["timestamp", "2022-07-21 11:17:22.181723"], ["updated_at", "2022-08-19 13:21:20.381058"], ["id", 1]]